app/controllers/coordinateds_controller.rb

  def create
    coordinateds = Coordinated.where("coordinateds.origin ilike ? and
                                      coordinateds.destination ilike ?",
                                      params['origin'].downcase, params['destination'].downcase)
                              .first

    if coordinateds.present?
      coordinateds.update(distance: params['distance'].to_i)
    else
      Coordinated.create(coordinateds_attributes)
---
SELECT  "coordinateds".* FROM "coordinateds" WHERE (coordinateds.origin ilike 'minha casa' and
SELECT  1 AS one FROM "coordinateds" WHERE LOWER("coordinateds"."destination") = LOWER($1) AND ("coordinateds"."id" != $2) LIMIT $3  [["destination", "meu trampo"], ["id", 1], ["LIMIT", 1]]
UPDATE "coordinateds" SET "distance" = $1 WHERE "coordinateds"."id" = $2  [["distance", 1150], ["id", 1]]
INSERT INTO "coordinateds" ("origin", "destination", "distance") VALUES ($1, $2, $3) RETURNING "id"  [["origin", "minha casa"], ["destination", "meu trampo"], ["distance", 100]]