app/controllers/costs_controller.rb

  def index
    coordinateds = Coordinated.all
---
SELECT  "coordinateds".* FROM "coordinateds" WHERE (Meu trampo) LIMIT $1  [["LIMIT", 1]]